app/Controllers/Login.php

    public function login()
    {
        $data = array();
        helper(['form']);

        if($this->request->getMethod() == 'post')
        {
            $post = $this->request->getPost(['email_address', 'password']);

            $rules = [
                'email_address' => ['label' => 'email address', 'rules' => 'required|valid_email'],
                'password' => ['label' => 'password', 'rules' => 'required']
            ];

            if(!$this->validate($rules))
            {
                $data['validation'] = $this->validator;
            }
            else
            {
                $userModel = new \App\Models\UserModel();
                $user = $userModel->where('email_address', $post['email_address'])->where('password', sha1($post['password']))
                ->join('tbl_genders', 'tbl_genders.gender_id = tbl_users.gender_id', 'inner')
                ->join('tbl_positions', 'tbl_positions.position_id = tbl_users.position_id', 'inner')->first();
---
SELECT *
FROM `tbl_users`
INNER JOIN `tbl_genders` ON `tbl_genders`.`gender_id` = `tbl_users`.`gender_id`
INNER JOIN `tbl_positions` ON `tbl_positions`.`position_id` = `tbl_users`.`position_id`
WHERE `email_address` = 'joven@gmail.com'
AND `password` = 'd033e22ae348aeb5660fc2140aec35850c4da997'
 LIMIT 1