app/Controllers/Student.php

SELECT `tbl_students`.`student_id`, `tbl_students`.`first_name`, `tbl_students`.`middle_name`, `tbl_students`.`last_name`, `tbl_genders`.`gender`, `tbl_students`.`age`, `tbl_students`.`address`, `tbl_students`.`contact_number`, `tbl_students`.`email_address`, `tbl_students`.`created_at`, `tbl_students`.`updated_at`
FROM `tbl_students`
JOIN `tbl_genders` ON `tbl_genders`.`gender_id` = `tbl_students`.`gender_id`
JOIN `tbl_users` ON `tbl_users`.`user_id` = `tbl_students`.`user_id`
WHERE `tbl_students`.`user_id` = '5'
ORDER BY `tbl_students`.`first_name` ASC
---

namespace App\Controllers;

class Student extends BaseController
{
    public function list()
    {
        // Load list of students with table genders and users using inner join
        $studentModel = new \App\Models\StudentModel();
        $data['students'] = $studentModel->select('tbl_students.student_id, tbl_students.first_name, tbl_students.middle_name, tbl_students.last_name,
        tbl_genders.gender, tbl_students.age, tbl_students.address, tbl_students.contact_number, tbl_students.email_address,
        tbl_students.created_at, tbl_students.updated_at')->where('tbl_students.user_id', session()->get('myUserId'))
        ->join('tbl_genders', 'tbl_genders.gender_id = tbl_students.gender_id')
        ->join('tbl_users', 'tbl_users.user_id = tbl_students.user_id')
        ->orderBy('tbl_students.first_name', 'asc')->findAll();

SELECT `tbl_students`.`student_id`, `tbl_students`.`first_name`, `tbl_students`.`middle_name`, `tbl_students`.`last_name`, `tbl_genders`.`gender`, `tbl_students`.`age`, `tbl_students`.`address`, `tbl_students`.`contact_number`, `tbl_students`.`email_address`, `tbl_users`.`first_name` as `user_first_name`, `tbl_users`.`middle_name` as `user_middle_name`, `tbl_users`.`last_name` as `user_last_name`, `tbl_students`.`created_at`, `tbl_students`.`updated_at`
FROM `tbl_students`
JOIN `tbl_genders` ON `tbl_genders`.`gender_id` = `tbl_students`.`gender_id`
JOIN `tbl_users` ON `tbl_users`.`user_id` = `tbl_students`.`user_id`
WHERE `tbl_students`.`student_id` = '2'
DELETE FROM `tbl_students`
WHERE `student_id` IN ('6')
---
    public function delete($id)
    {
        // Select student by id and return to delete confirmation page
        $studentModel = new \App\Models\StudentModel();
        $data['student'] = $studentModel->select('tbl_students.student_id, tbl_students.first_name, tbl_students.middle_name, tbl_students.last_name,
        tbl_genders.gender, tbl_students.age, tbl_students.address, tbl_students.contact_number, tbl_students.email_address,
        tbl_users.first_name as user_first_name, tbl_users.middle_name as user_middle_name, tbl_users.last_name as user_last_name,
        tbl_students.created_at, tbl_students.updated_at')
        ->join('tbl_genders', 'tbl_genders.gender_id = tbl_students.gender_id')
        ->join('tbl_users', 'tbl_users.user_id = tbl_students.user_id')->find($id);

        // When button delete clicked
        if($this->request->getMethod() == 'post')
        {
            // Delete the selected student
            $studentModel->delete($id);