app/Controllers/Teacher.php

SELECT *
FROM `tbl_users`
INNER JOIN `tbl_genders` ON `tbl_genders`.`gender_id` = `tbl_users`.`gender_id`
INNER JOIN `tbl_positions` ON `tbl_positions`.`position_id` = `tbl_users`.`position_id`
ORDER BY `first_name` ASC
---
    public function list()
    {
        $userModel = new \App\Models\UserModel();
        $data['users'] = $userModel->join('tbl_genders', 'tbl_genders.gender_id = tbl_users.gender_id', 'inner')
        ->join('tbl_positions', 'tbl_positions.position_id = tbl_users.position_id', 'inner')
        ->orderBy('first_name', 'asc')->findAll();